# Proyecto 1 (A): Algoritmos de Regresión 
### Aprendizaje Automático 

Antonio Ayora, Abril Esparza, Saúl Tax

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df= pd.read_csv("insurance.csv")
df.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [3]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [4]:
df['region'].value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [5]:
def sex_num(x):
    if x == "female":
        return 2
    else:
        return 1

def smoker_num(x):
    if x == "yes":
        return 2
    else:
        return 1
    
def region_num(x):
    if x == "southeast":
        return 1
    elif x == "southwest":
        return 2
    elif x == "northwest":
        return 3
    else:
        return 4

In [6]:
df['Sex_value'] = df['sex'].apply(sex_num)
df['Smoker_value']=df['smoker'].apply(smoker_num)
df['region_value']=df['region'].apply(region_num)
df.head()

,age,sex,bmi,children,smoker,region,charges,Sex_value,Smoker_value,region_value
0,19,female,27.900,0,yes,southwest,16884.92400,2,2,2
1,18,male,33.770,1,no,southeast,1725.55230,1,1,1
2,28,male,33.000,3,no,southeast,4449.46200,1,1,1
3,33,male,22.705,0,no,northwest,21984.47061,1,1,3
4,32,male,28.880,0,no,northwest,3866.85520,1,1,3

In [7]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges',
       'Sex_value', 'Smoker_value', 'region_value'],
      dtype='object')

In [10]:
df = df.reindex(columns=['age', 'sex', 'bmi', 'children', 'smoker', 'region',
...       'Sex_value', 'Smoker_value', 'region_value', 'charges'])
df

,age,sex,bmi,children,smoker,region,Sex_value,Smoker_value,region_value,charges
0,19,female,27.900,0,yes,southwest,2,2,2,16884.92400
1,18,male,33.770,1,no,southeast,1,1,1,1725.55230
2,28,male,33.000,3,no,southeast,1,1,1,4449.46200
3,33,male,22.705,0,no,northwest,1,1,3,21984.47061
4,32,male,28.880,0,no,northwest,1,1,3,3866.85520
...,...,...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,no,northwest,1,1,3,10600.54830
1334,18,female,31.920,0,no,northeast,2,1,4,2205.98080
1335,18,female,36.850,0,no,southeast,2,1,1,1629.83350
1336,21,female,25.800,0,no,southwest,2,1,2,2007.94500
1337,61,female,29.070,0,yes,northwest,2,2,3,29141.36030